<h1 style="text-align: center;"><strong>POL&Iacute;TICAS DE PRIVACIDAD</strong></h1>
<h2 style="text-align: left;"><strong>Introducci&oacute;n</strong></h2>
<p>Bienvenido a "World Flags", la aplicaci&oacute;n m&oacute;vil que te invita a explorar y aprender sobre las naciones del mundo de manera interactiva y visual. Desarrollada con la tecnolog&iacute;a m&aacute;s reciente en Android usando Kotlin y Jetpack Compose, nuestra aplicaci&oacute;n ofrece una experiencia educativa accesible para todos los grupos de edad.</p>
<p>En "World Flags", valoramos la privacidad y la seguridad de nuestros usuarios. Esta Pol&iacute;tica de Privacidad tiene como objetivo informarte sobre nuestras pr&aacute;cticas respecto al manejo de informaci&oacute;n. Es importante destacar que nuestra aplicaci&oacute;n no recopila, almacena ni procesa datos personales de los usuarios, asegurando una experiencia de aprendizaje segura y privada.</p>
<p>Te invitamos a leer esta Pol&iacute;tica de Privacidad detenidamente para entender c&oacute;mo se manejan los datos dentro de "World Flags". Si tienes preguntas o necesitas m&aacute;s informaci&oacute;n, no dudes en contactarnos a trav&eacute;s de los medios proporcionados al final de este documento.</p>
<p>&nbsp;</p>
<h2><strong>Informaci&oacute;n Recopilada</strong></h2>
<p>"World Flags" se compromete a proteger la privacidad de sus usuarios. Es importante para nosotros ser transparentes sobre el manejo de la informaci&oacute;n:</p>
<ol>
<li>
<h3><strong>Datos Personales:</strong></h3>
<ul>
<li><strong>No Recolecci&oacute;n de Datos Personales:</strong> "World Flags" no recopila, almacena ni procesa datos personales de los usuarios. No requerimos que los usuarios se registren ni proporcionen informaci&oacute;n personal para descargar o utilizar nuestra aplicaci&oacute;n.</li>
</ul>
</li>
<li>
<h3><strong>Datos No Personales:</strong></h3>
<ul>
<li><strong>Datos de Uso:</strong> Aunque no recopilamos informaci&oacute;n personal, podemos recoger datos an&oacute;nimos relacionados con el uso de la aplicaci&oacute;n. Esto incluye informaci&oacute;n t&eacute;cnica como el tipo de dispositivo, la versi&oacute;n del sistema operativo, y estad&iacute;sticas de uso como las p&aacute;ginas m&aacute;s visitadas o las funciones m&aacute;s utilizadas. Estos datos son recopilados exclusivamente para mejorar la funcionalidad y el rendimiento de nuestra aplicaci&oacute;n.</li>
<li><strong>Analytics:</strong> Utilizamos herramientas de an&aacute;lisis para comprender mejor c&oacute;mo se utiliza nuestra aplicaci&oacute;n en general. Estas herramientas recogen datos de forma agregada y an&oacute;nima, lo que significa que no pueden ser utilizados para identificar a ning&uacute;n usuario individualmente.</li>
</ul>
</li>
<li>
<h3><strong>Permisos de Dispositivos:</strong></h3>
<ul>
<li><strong>Accesos Solicitados:</strong> "World Flags" podr&iacute;a requerir acceso a ciertas funciones del dispositivo, como conexi&oacute;n a internet para cargar informaci&oacute;n de pa&iacute;ses de fuentes en l&iacute;nea. No obstante, cualquier permiso requerido ser&aacute; claramente comunicado y justificado al usuario antes de su activaci&oacute;n.</li>
</ul>
</li>
</ol>
<p>&nbsp;</p>
<h2><strong>Uso de la Informaci&oacute;n</strong></h2>
<p>En "World Flags", el uso de la informaci&oacute;n recopilada se limita a los siguientes prop&oacute;sitos:</p>
<ol>
<li>
<h3><strong>Mejora de la Aplicaci&oacute;n:</strong></h3>
<ul>
<li><strong>An&aacute;lisis y Desarrollo:</strong> Utilizamos los datos no personales y agregados obtenidos a trav&eacute;s de las herramientas de an&aacute;lisis para entender mejor c&oacute;mo se utiliza nuestra aplicaci&oacute;n. Esto nos ayuda a identificar &aacute;reas de mejora y a optimizar la funcionalidad y la experiencia del usuario. Por ejemplo, podemos ajustar la interfaz de usuario seg&uacute;n las secciones m&aacute;s frecuentadas o resolver problemas t&eacute;cnicos que afecten el rendimiento de la aplicaci&oacute;n.</li>
</ul>
</li>
<li>
<h3><strong>Soporte T&eacute;cnico:</strong></h3>
<ul>
<li><strong>Diagn&oacute;stico y Resoluci&oacute;n de Problemas:</strong> En caso de problemas t&eacute;cnicos o fallos en la aplicaci&oacute;n, los datos recopilados nos permiten diagnosticar y solucionar problemas de manera eficiente. Esto asegura que "World Flags" funcione de manera &oacute;ptima y continua para todos los usuarios.</li>
</ul>
</li>
<li>
<h3><strong>Interacci&oacute;n del Usuario:</strong></h3>
<ul>
<li><strong>Mejora de la Interactividad:</strong> Los datos sobre c&oacute;mo los usuarios interact&uacute;an con las diferentes caracter&iacute;sticas de la aplicaci&oacute;n pueden guiarnos en la creaci&oacute;n o modificaci&oacute;n de funciones para hacer la experiencia m&aacute;s interactiva y educativa. Por ejemplo, podr&iacute;amos introducir nuevas funciones de exploraci&oacute;n o mejorar las existentes en base a la popularidad y la retroalimentaci&oacute;n impl&iacute;cita mediante el uso de la app.</li>
</ul>
</li>
<li>
<h3><strong>Cumplimiento Legal y Regulaciones:</strong></h3>
<ul>
<li><strong>Cumplimiento con las Leyes:</strong> Aunque "World Flags" no recopila datos personales, estamos comprometidos a cumplir con todas las leyes y regulaciones aplicables. Cualquier informaci&oacute;n recopilada ser&aacute; utilizada en conformidad con la legislaci&oacute;n vigente para asegurar que estamos operando dentro de los l&iacute;mites legales.</li>
</ul>
</li>
</ol>
<p>&nbsp;</p>
<h2><strong>Compartici&oacute;n de la Informaci&oacute;n</strong></h2>
<p>"World Flags" respeta la privacidad de sus usuarios y maneja la informaci&oacute;n recopilada con la mayor discreci&oacute;n y seguridad. A continuaci&oacute;n, se describe c&oacute;mo y con qui&eacute;n puede ser compartida esta informaci&oacute;n:</p>
<ol>
<li>
<h3><strong>No Compartici&oacute;n de Datos Personales:</strong></h3>
</li>
<ul>
<li><strong>Pol&iacute;tica de Privacidad Estricta:</strong> Dado que no recopilamos datos personales, no existe posibilidad de compartir informaci&oacute;n personal de nuestros usuarios con terceros.</li>
</ul>
<li>
<h3><strong>Datos No Personales:</strong></h3>
</li>
<ul>
<li><strong>Proveedores de Servicios y Anal&iacute;tica:</strong> Podemos compartir datos no personales, de forma agregada y an&oacute;nima, con proveedores de servicios tercerizados que nos ayudan a operar y mejorar nuestra aplicaci&oacute;n. Esto incluye, por ejemplo, servicios de an&aacute;lisis de datos que nos permiten entender patrones de uso de la app para optimizar nuestras funciones y servicios. Estos proveedores est&aacute;n sujetos a acuerdos de confidencialidad que les obligan a mantener la seguridad de los datos y a utilizarlos solo para los fines acordados.</li>
<li><strong>Investigaciones y Estudios de Mercado:</strong> Ocasionalmente, podemos compartir informaci&oacute;n estad&iacute;stica no personal con organizaciones educativas o de investigaci&oacute;n que realizan estudios sobre tendencias de mercado o comportamiento educativo. Estos datos se proporcionan de manera que no se pueda identificar a ning&uacute;n usuario individual.</li>
</ul>
<li>
<h3><strong>Requerimientos Legales:</strong></h3>
</li>
<ul>
<li><strong>Cumplimiento Legal:</strong> En casos excepcionales, podr&iacute;amos estar obligados a compartir datos con autoridades legales o reguladoras si esto se requiere bajo la ley, como en respuesta a una orden judicial o un proceso legal similar. En tales situaciones, nos esforzaremos por limitar la divulgaci&oacute;n a lo estrictamente necesario y, cuando sea posible, notificar a los usuarios afectados antes de compartir sus datos.</li>
</ul>
<li>
<h3><strong>Transferencias de Negocio:</strong></h3>
</li>
<ul>
<li><strong>Adquisiciones o Fusiones:</strong> En el caso de una venta, fusi&oacute;n o adquisici&oacute;n de nuestra empresa, los datos no personales pueden ser parte de los activos transferidos. En tal evento, nos comprometemos a asegurar que la entidad receptora mantenga esta pol&iacute;tica de privacidad o una similar que proteja tus datos.</li>
</ul>
</ol>
<p>&nbsp;</p>
<h2><strong>Derechos del Usuario</strong></h2>
<p>En "World Flags", nos comprometemos a garantizar que nuestros usuarios tengan claridad sobre sus derechos con respecto al uso de la aplicaci&oacute;n y la informaci&oacute;n que se recopila. Aunque nuestra aplicaci&oacute;n no recopila datos personales, creemos que es importante informar a los usuarios sobre sus derechos generales:</p>
<ol>
<li>
<h3><strong>Acceso a la Informaci&oacute;n:</strong></h3>
</li>
<ul>
<li><strong>Transparencia de la Informaci&oacute;n:</strong> Los usuarios tienen derecho a ser informados sobre los tipos de datos no personales que se recopilan y c&oacute;mo estos se utilizan. Aunque "World Flags" no recolecta datos personales, cualquier informaci&oacute;n sobre el uso de datos no personales est&aacute; disponible para los usuarios que lo soliciten.</li>
</ul>
<li>
<h3><strong>Rectificaci&oacute;n y Eliminaci&oacute;n:</strong></h3>
</li>
<ul>
<li><strong>Correcci&oacute;n de Datos:</strong> En el caso hipot&eacute;tico de que se recogieran datos personales en el futuro, los usuarios tendr&iacute;an derecho a solicitar la correcci&oacute;n de datos incorrectos.</li>
<li><strong>Eliminaci&oacute;n de Datos:</strong> Los usuarios podr&iacute;an solicitar la eliminaci&oacute;n de sus datos personales de nuestros registros, siempre que la ley lo permita y no se requiera mantener dicha informaci&oacute;n por razones legales o regulatorias.</li>
</ul>
<li>
<h3><strong>Objeci&oacute;n al Uso de Datos:</strong></h3>
</li>
<ul>
<li><strong>Derecho a Oponerse:</strong> Los usuarios tendr&iacute;an el derecho de oponerse al procesamiento de sus datos personales para ciertos fines, si en alg&uacute;n momento en el futuro se modificaran las pr&aacute;cticas de recopilaci&oacute;n de datos de la aplicaci&oacute;n.</li>
</ul>
<li>
<h3><strong>Portabilidad de los Datos:</strong></h3>
</li>
<ul>
<li><strong>Transferencia de Datos:</strong> Si recogi&eacute;ramos datos personales, los usuarios tendr&iacute;an derecho a recibir sus datos en un formato estructurado y com&uacute;nmente usado, y a transferir esos datos a otro controlador sin impedimentos por nuestra parte.</li>
</ul>
<li>
<h3><strong>Consentimiento y Retirada del Consentimiento:</strong></h3>
</li>
<ul>
<li><strong>Gesti&oacute;n del Consentimiento:</strong> En caso de que en el futuro se requiera el consentimiento para recoger o usar datos personales, los usuarios tendr&aacute;n siempre la opci&oacute;n de otorgar o retirar su consentimiento de manera informada y libre.</li>
</ul>
<li>
<h3><strong>Reclamaciones:</strong></h3>
</li>
<ul>
<li><strong>Derecho a Presentar Reclamaciones:</strong> Los usuarios tienen derecho a presentar una reclamaci&oacute;n ante una autoridad supervisora competente en materia de protecci&oacute;n de datos si consideran que el tratamiento de sus datos personales no cumple con las regulaciones legales.</li>
</ul>
</ol>
<p>&nbsp;</p>
<h2><strong>Seguridad de la Informaci&oacute;n</strong></h2>
<p>En "World Flags", tomamos la seguridad de la informaci&oacute;n muy en serio, incluso cuando la aplicaci&oacute;n actualmente no recopila datos personales. Nuestro compromiso con la seguridad se extiende a todos los aspectos de nuestra plataforma y se implementa mediante una serie de medidas robustas:</p>
<ol>
<li>
<h3><strong>Medidas T&eacute;cnicas:</strong></h3>
</li>
<ul>
<li><strong>Protecci&oacute;n de Infraestructura:</strong> Utilizamos tecnolog&iacute;as de seguridad avanzadas para proteger nuestra infraestructura de hosting y nuestros dispositivos. Esto incluye firewalls, cifrado de datos, y protocolos de seguridad para el acceso a los servidores.</li>
<li><strong>Seguridad en el Software:</strong> Nuestra aplicaci&oacute;n est&aacute; dise&ntilde;ada siguiendo las mejores pr&aacute;cticas de programaci&oacute;n segura. Realizamos revisiones de c&oacute;digo regularmente y aplicamos pruebas de penetraci&oacute;n y de vulnerabilidad para identificar y mitigar posibles riesgos de seguridad.</li>
</ul>
<li>
<h3><strong>Medidas Organizativas:</strong></h3>
</li>
<ul>
<li><strong>Capacitaci&oacute;n de Empleados:</strong> Todos nuestros empleados que tienen acceso a cualquier forma de datos t&eacute;cnicos son entrenados en principios b&aacute;sicos de seguridad y protecci&oacute;n de datos. Aseguramos que comprendan la importancia de proteger la informaci&oacute;n y de aplicar las mejores pr&aacute;cticas de seguridad en su trabajo diario.</li>
<li><strong>Pol&iacute;ticas de Seguridad:</strong> Contamos con pol&iacute;ticas internas estrictas que regulan el acceso y el manejo de cualquier informaci&oacute;n t&eacute;cnica para prevenir accesos no autorizados y posibles fugas de datos.</li>
</ul>
<li>
<h3><strong>Respuesta a Incidentes:</strong></h3>
</li>
<ul>
<li><strong>Gesti&oacute;n de Incidentes:</strong> Hemos establecido procedimientos claros para responder a incidentes de seguridad. En caso de una brecha de seguridad, tenemos protocolos para mitigar r&aacute;pidamente el impacto, analizar el incidente, y restaurar la seguridad de nuestra plataforma.</li>
<li><strong>Notificaci&oacute;n de Brechas:</strong> En caso de que informaci&oacute;n no personal se vea comprometida, nos comprometemos a informar a los usuarios y autoridades relevantes conforme a las leyes aplicables, aunque actualmente no recolectamos datos personales.</li>
</ul>
<li>
<h3><strong>Compromiso con la Mejora Continua:</strong></h3>
</li>
<ul>
<li><strong>Evaluaciones y Mejoras Continuas:</strong> Continuamente evaluamos y mejoramos nuestras pr&aacute;cticas de seguridad de la informaci&oacute;n para adaptarnos a nuevos desaf&iacute;os y amenazas, asegurando que mantenemos un entorno seguro para nuestros usuarios y para la informaci&oacute;n que manejamos.</li>
</ul>
</ol>
<p>&nbsp;</p>
<h2><strong>Cambios en la Pol&iacute;tica de Privacidad</strong></h2>
<p>En "World Flags", nos reservamos el derecho de modificar esta Pol&iacute;tica de Privacidad en cualquier momento para reflejar cambios en nuestras pr&aacute;cticas de manejo de informaci&oacute;n, cambios en la legislaci&oacute;n aplicable, o mejoras en nuestra aplicaci&oacute;n. Es importante que los usuarios revisen peri&oacute;dicamente esta pol&iacute;tica para estar al tanto de cualquier cambio. A continuaci&oacute;n, se describen nuestras pr&aacute;cticas respecto a los cambios en la pol&iacute;tica:</p>
<ol>
<li>
<h3><strong>Notificaci&oacute;n de Cambios:</strong></h3>
</li>
<ul>
<li><strong>Comunicaci&oacute;n Activa:</strong> Cualquier cambio significativo en nuestra Pol&iacute;tica de Privacidad ser&aacute; comunicado a nuestros usuarios a trav&eacute;s de nuestra aplicaci&oacute;n o por medio de nuestro sitio web. Consideramos cambios significativos aquellos que alteran la naturaleza de la recopilaci&oacute;n o el uso de la informaci&oacute;n personal, si en alg&uacute;n momento comenzamos a recogerla.</li>
<li><strong>Resumen de Cambios:</strong> Para facilitar la comprensi&oacute;n de cualquier modificaci&oacute;n, proporcionaremos un resumen de los cambios m&aacute;s importantes y, si es necesario, explicaciones detalladas de estos cambios.</li>
</ul>
<li>
<h3><strong>Acceso a Versiones Anteriores:</strong></h3>
</li>
<ul>
<li><strong>Archivo de Pol&iacute;ticas:</strong> Mantendremos un archivo accesible de versiones anteriores de nuestra Pol&iacute;tica de Privacidad para que los usuarios puedan revisar los cambios a lo largo del tiempo. Esto puede ser especialmente &uacute;til para aquellos interesados en ver c&oacute;mo evolucionan nuestras pr&aacute;cticas y pol&iacute;ticas.</li>
</ul>
<li>
<h3><strong>Fecha de Vigencia:</strong></h3>
</li>
<ul>
<li><strong>Implementaci&oacute;n Inmediata:</strong> Los cambios en la Pol&iacute;tica de Privacidad entrar&aacute;n en vigor inmediatamente despu&eacute;s de su publicaci&oacute;n en la aplicaci&oacute;n o en el sitio web. La fecha de la &uacute;ltima actualizaci&oacute;n se mostrar&aacute; claramente en la parte superior de la Pol&iacute;tica de Privacidad para asegurar que los usuarios est&eacute;n informados de cu&aacute;ndo se realiz&oacute; la &uacute;ltima revisi&oacute;n.</li>
</ul>
<li>
<h3><strong>Consentimiento del Usuario:</strong></h3>
</li>
<ul>
<li><strong>Revisi&oacute;n y Consentimiento:</strong> Al continuar utilizando "World Flags" despu&eacute;s de que se hayan implementado cambios en la Pol&iacute;tica de Privacidad, se considerar&aacute; que los usuarios han aceptado las modificaciones. Si en el futuro recopilamos datos personales y los cambios afectan a estos datos, solicitaremos el consentimiento expl&iacute;cito de los usuarios para cualquier nuevo uso propuesto.</li>
</ul>
</ol>
<p>&nbsp;</p>
<h2><strong>Contacto</strong></h2>
<p>Si tienes alguna pregunta o inquietud acerca de nuestra Pol&iacute;tica de Privacidad, o si deseas obtener m&aacute;s informaci&oacute;n sobre nuestras pr&aacute;cticas de privacidad en "World Flags", no dudes en contactarnos. Estamos comprometidos a resolver tus dudas y proporcionarte la informaci&oacute;n que necesites:</p>
<ol>
<li>
<h3><strong>Informaci&oacute;n de Contacto:</strong></h3>
</li>
<ul>
<li><strong>Correo Electr&oacute;nico:</strong> Puedes enviarnos un correo electr&oacute;nico a luisdanielmartinezbarrios00@gmail.com. Nos esforzamos por responder a todas las consultas dentro de los 48 horas h&aacute;biles.</li>
<li><strong>Tel&eacute;fono:</strong> Para asistencia inmediata, puedes llamarnos al +57 3135812313 durante horas de oficina (9:00 a 17:00) (UTC -05:00).</li>
</ul>
</ol>
